08-rails/moma/app/views/artists/show.html.erb

SELECT "works".* FROM "works" WHERE "works"."artist_id" = $1  [["artist_id", 9]]
---

<% @artist.works.each do |work| %>