09-tdd/fruitstore/app/controllers/fruits_controller.rb

  def index
    @fruits = Fruit.order('id DESC')
---
SELECT "fruits".* FROM "fruits" ORDER BY id DESC

  def create
    @fruit = Fruit.new fruit_params
    if @fruit.save
---
INSERT INTO "fruits" ("created_at", "updated_at", "name") VALUES (?, ?, ?)  [["created_at", "2019-02-18 04:28:03.808951"], ["updated_at", "2019-02-18 04:28:03.808951"], ["name", "Dragon fruit"]]