08-rails/moma/app/views/works/show.html.erb

  <li>Title: <%= @work.title %></li>
  <% if @work.artist.present? %>
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]