08-rails/moma/app/controllers/artists_controller.rb

  def show
    @artist = Artist.find params[:id]
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    artist = Artist.create artist_params
---
INSERT INTO "artists" ("name", "nationality", "period", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Some Jerk"], ["nationality", ""], ["period", ""], ["image", ""], ["created_at", "2019-01-16 01:21:44.110354"], ["updated_at", "2019-01-16 01:21:44.110354"]]

  def edit
    @artist = Artist.find params[:id]
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    artist = Artist.find params[:id]
    artist.update artist_params
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artists" SET "period" = $1, "updated_at" = $2 WHERE "artists"."id" = $3  [["period", "Surrealism"], ["updated_at", "2019-01-16 02:52:38.057298"], ["id", 3]]

  def destroy
    artist = Artist.find params[:id]
    artist.destroy
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = $1  [["id", 2]]