08-rails/moma/app/controllers/works_controller.rb

SELECT "works".* FROM "works"
---
  def index
    @works = Work.all

SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @work = Work.find params[:id]

INSERT INTO "works" ("title", "year", "medium", "style", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    work = Work.create work_params

SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def edit
    @work = Work.find params[:id]

SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "works" SET "artist_id" = $1, "updated_at" = $2 WHERE "works"."id" = $3  [["artist_id", 15], ["updated_at", "2019-01-16 04:35:06.147665"], ["id", 7]]
---
  def update
    work = Work.find params[:id]
    work.update work_params

SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "works" WHERE "works"."id" = $1  [["id", 11]]
---
  def destroy
    work = Work.find params[:id]
    work.destroy