08-rails/solar_system/app/controllers/planets_controller.rb

SELECT "planets".* FROM "planets"
---
  def index
    @planets = Planet.all

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @planet = Planet.find params[:id]

INSERT INTO "planets" ("name", "image", "moons") VALUES (?, ?, ?)  [["name", "Mercury"], ["image", "https://upload.wikimedia.org/wikipedia/commons/d/d9/Mercury_in_color_-_Prockter07-edit1.jpg"], ["moons", 0]]
---
  def create
    planet = Planet.new
    planet.name = params[:name]
    planet.image = params[:image]
    planet.orbit = params[:orbit]
    planet.diameter = params[:diameter]
    planet.mass = params[:mass]
    planet.moons = params[:moons]
    planet.save # THIS DOES THE SQL INSERT STATEMENT. THIS WILL ALSO SET A NEW ID

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @planet = Planet.find params[:id]

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "planets" SET "image" = ? WHERE "planets"."id" = ?  [["image", "https://www.google.com/search?q=earth&hl=en&source=lnms&tbm=isch&sa=X&ved=0ahUKEwiV_bWo6-7fAhUObisKHU3EAvsQ_AUIDigB&biw=1440&bih=718#imgrc=4tGfU8fAdAbPRM:"], ["id", 1]]
---
  def update
    planet = Planet.find params[:id]
    planet.name = params[:name]
    planet.image = params[:image]
    planet.orbit = params[:orbit]
    planet.diameter = params[:diameter]
    planet.mass = params[:mass]
    planet.moons = params[:moons]
    planet.save